
## Plan Result (terraform/agent/dev/global/client-user-verification/s3)

[CI link](https://github.com/mileslee-nsuslab/tfaction-example/actions/runs/6434795518)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket.s3_bucket


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-235264"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "env" = "dev"
        }
      + tags_all                    = {
          + "env" = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/agent/dev/global/client-user-verification/s3/add-or-update: POST https://api.github.com/repos/mileslee-nsuslab/tfaction-example/issues/74/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":74,"Program":"tfcmt","SHA1":"79d9086e7c7a60eb94dd25936758b8735e713fb2","Target":"terraform/agent/dev/global/client-user-verification/s3","Vars":{},"WorkflowName":"plan"} -->